{"title": "Xbox Series S – Starter Bundle - Includes hundreds of games with Game Pass Ultimate 3 Month Membership - 512GB SSD All-Digital Gaming Console", "price": "$288.00", "About this item": " GAME PASS ULTIMATE: Jump into the world of Xbox with everything you need to play, including an Xbox Series S and hundreds of high-quality games with 3 months of Game Pass Ultimate.*  \n IN THE BOX: Bundle includes: Xbox Series S console, 3 month Xbox Game Pass Ultimate membership, one Xbox Wireless Controller, a high-speed HDMI cable, power cable, and 2 AA batteries.  \n XBOX SERIES S: Experience the best value in gaming with Xbox Series S, featuring a 512GB custom SSD.  \n Make the most of every gaming minute with Quick Resume, lightning-fast load times, and gameplay of up to 120 FPS—all powered by Xbox Velocity Architecture  \n Be the first to play new games like Starfield and Forza Motorsport on day one with the included 3 months of Game Pass Ultimate. Plus, enjoy hundreds of other high-quality games like Minecraft Legends, Halo Infinite, and Forza Horizon 5.  \n With Game Pass Ultimate, play together with friends via online multiplayer and enjoy an EA Play membership which gives you access to top titles on console and PC, including best-loved series like F1, Battlefield, and STAR WARS.  \n", "product-information": {" ASIN ": " B0CFS1SDC4 ", " Release date ": " October 31, 2023 ", "Customer Reviews": "4.6, 454 ratings", " Best Sellers Rank ": "  #37 in Video Games (See Top 100 in Video Games)  #1 in Xbox Consoles   ", " Product Dimensions ": " 11.5 x 14.17 x 5.04 inches; 4.2 Pounds ", " Type of item ": " Accessory ", " Language ": " English ", " Rated ": " Everyone ", " Item model number ": " FBAMSRRS00144 ", " Item Weight ": " 4.2 pounds ", " Manufacturer ": " Microsoft ", " Batteries ": " 2 AA batteries required. (included) ", " Date First Available ": " October 12, 2023 "}, "reviewlink": "/Xbox-Starter-hundreds-Ultimate-Membership-All-Digital/product-reviews/B0CFS1SDC4/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews"}